{
	"Name": "Lucas Carol Sales Duarte",
	"Signature": "Lucas Carol SD",
	"Contacts": [
		{
			"Name": "Github",
			"Value": "https://github.com/darakeon"
		},
		{
			"Name": "Linkedin",
			"Value": "https://linkedin.com/in/lc-sales-duarte"
		},
		{
			"Name": {
				"PT": "E-mail",
				"EN": "Mail"
			},
			"Value": "lc.sales.duarte@gmail.com"
		},
		{
			"Name": {
				"PT": "Telefone",
				"EN": "Phone"
			},
			"Value": {
				"PT": "(11) 986-372-833",
				"EN": "+55 11 986372833"
			}
		}
	],
	"Marker": "LCSD",
	"TitleColor": "204",
	"SubtitleColor": "511",
	"DarkColor": "622",
	"LightColor": "FAA",
	"Font": "Calibri",
	"CoverLetterTitle": {
		"PT": "carta de apresentação",
		"EN": "cover letter"
	},
	"CoverLetter": [
		{
			"Paragraph": {
				"PT": "Trabalho com desenvolvimento de software na área de consultoria. Já trabalhei com C# .NET, Node, Kotlin, tecnologias de Frontend (HTML, CSS e Javascript), Python e Rust; TDD e BDD para testes; bancos de dados MySQL, Postgres e SQL Server; e Docker, Docker Compose e AWS para infraestrutura.",
				"EN": "I am a software developer working as consultant. I've worked already with C# .NET, Node, Kotlin, Frontend technologies (HTML, CSS and Javascript), Python and Rust; TDD and BDD for testing; MySQL, Postgres and SQL Server databases; and Docker, Docker Compose and AWS for infrastructure."
			}
		},
		{
			"Paragraph": {
				"PT": "Antes da faculdade fiz um curso de desenvolvimento web. Trabalhei como freelancer fazendo alguns sites simples. Um mês após entrar na faculdade uma pessoa me chamou para lhe substituir na empresa devido a minha capacidade com lógica. Depois disso, assumi todo o sistema, desde o banco de dados até o frontend. Porém lá eram usadas apenas tecnologias e práticas desatualizadas.",
				"EN": "Before college, I made a web developer course. I worked as freelancer making some simple websites. One month after starting college, a colleague called me to be replace them at the company given my habilities with logic. There I took care of the whole system, since database to frontend. But there I only used old technologies and practices."
			}
		},
		{
			"Paragraph": {
				"PT": "Mudei para uma empresa de consultoria em desenvolvimento. Na nova empresa, aprendi melhores práticas, como versionamento, orientação a objetos, princípios e práticas ágeis. Tenho orgulho de ter trabalhado nessa empresa até os dias de hoje. Enquanto estava lá, iniciei meu projeto pessoal, chamado Don't fly Money, de controle financeiro pessoal; este ainda hoje é meu espaço para testes e uma grande fonte de aprendizado. Usei nele tecnologias e conceitos que mais tarde usaria para resolver problemas de clientes.",
				"EN": "Then I moved to a company that act as software development consultancy. There I learned better practices, as versioning, object oriented programming, agile principles and practices. I'm proud of working there until nowadays. While there, I started my personal project, called Don't fly Money, of personal finantial management, which is my sandbox and a great source of learning since then. I used technologies in it that later I would use to solve problems of my companies' clients."
			}
		},
		{
			"Paragraph": {
				"PT": "Depois disso, trabalhei em uma empresa do ramo de pagamentos. Tinham seu próprio produtos e usavam muitas tecnologias novas, no desenvolvimento e na arquitetura. Lá aprendi Node e Rust. E trabalhei com Kotlin pela primeira vez, mas já conhecia, por ter usado no Don't fly money.",
				"EN": "After that, I worked in company in payment industry. They had their own product and they use a bunch of new technologies, in development and architecture. There I learned Node and Rust. And I worked with Kotlin for the first time, but I already knew it, because of Don't fly Money."
			}
		},
		{
			"Paragraph": {
				"PT": "De 2019 a 2022 trabalhei em uma empresa internacional de excelência em consultoria. Participei de quatro projetos dentro da empresa. Os projetos incluíram tecnologias como Node, Java, microserviços, Observabilidade, Grafana, Docker, Typescript e Google AppScripts. Fui \"security champion\" de meu último time, dada a minha atenção à segurança e detalhes que pessoas normalmente não costumam olhar.",
				"EN": "From 2019 to 2022 I worked at an international software excellence consultant. I took part in four projects at the company. The projects included technologies like Node, Java, microservices, Observability, Grafana, Docker, Typescript and Google AppScripts. I was the security champion of the last team, given my attention to security and details people don't use to notice."
			}
		}
	],
	"KnowledgesTitle": {
		"PT": "Conhecimento",
		"EN": "Knowlegdes"
	},
	"KnowledgesList": [
		{
			"Tech": ".NET",
			"Level": 5
		},
		{
			"Tech": ".NET Core",
			"Level": 5
		},
		{
			"Tech": "Agile",
			"Level": 5
		},
		{
			"Tech": "Amazon Web Services (AWS)",
			"Level": 3
		},
		{
			"Tech": "Android",
			"Level": 3
		},
		{
			"Tech": "AWS EC2",
			"Level": 4
		},
		{
			"Tech": "AWS Lambda",
			"Level": 3
		},
		{
			"Tech": "AWS RDS",
			"Level": 4
		},
		{
			"Tech": "AWS S3",
			"Level": 4
		},
		{
			"Tech": "AWS SES",
			"Level": 3
		},
		{
			"Tech": "Bash",
			"Level": 3
		},
		{
			"Tech": "BDD",
			"Level": 4
		},
		{
			"Tech": "Bootstrap",
			"Level": 2
		},
		{
			"Tech": "C#",
			"Level": 5
		},
		{
			"Tech": "CI/CD",
			"Level": 3
		},
		{
			"Tech": "CircleCi",
			"Level": 3
		},
		{
			"Tech": "CSS",
			"Level": 4
		},
		{
			"Tech": "Django",
			"Level": 2
		},
		{
			"Tech": "Docker",
			"Level": 2
		},
		{
			"Tech": "Docker Compose",
			"Level": 2
		},
		{
			"Tech": "Gradle",
			"Level": 2
		},
		{
			"Tech": "HTML",
			"Level": 4
		},
		{
			"Tech": "Java",
			"Level": 3
		},
		{
			"Tech": "JavaScript",
			"Level": 4
		},
		{
			"Tech": "jQuery",
			"Level": 3
		},
		{
			"Tech": "JUnit",
			"Level": 3
		},
		{
			"Tech": "Kanban",
			"Level": 4
		},
		{
			"Tech": "Kotlin",
			"Level": 3
		},
		{
			"Tech": "Linux",
			"Level": 3
		},
		{
			"Tech": "Microservices",
			"Level": 2
		},
		{
			"Tech": "Microsoft SQL",
			"Level": 3
		},
		{
			"Tech": "Mobile",
			"Level": 3
		},
		{
			"Tech": "MySQL",
			"Level": 4
		},
		{
			"Tech": "NHibernate",
			"Level": 4
		},
		{
			"Tech": "Nginx",
			"Level": 1
		},
		{
			"Tech": "Node",
			"Level": 2
		},
		{
			"Tech": "PostgreSQL",
			"Level": 2
		},
		{
			"Tech": "puppeteer",
			"Level": 2
		},
		{
			"Tech": "Python",
			"Level": 2
		},
		{
			"Tech": "React",
			"Level": 1
		},
		{
			"Tech": "Rust",
			"Level": 1
		},
		{
			"Tech": "Scrum",
			"Level": 3
		},
		{
			"Tech": "Selenium",
			"Level": 1
		},
		{
			"Tech": "SDK Development",
			"Level": 1
		},
		{
			"Tech": "Specflow",
			"Level": 2
		},
		{
			"Tech": "SQL",
			"Level": 4
		},
		{
			"Tech": "SQL Server",
			"Level": 2
		},
		{
			"Tech": "SQLite",
			"Level": 5
		},
		{
			"Tech": "SVG",
			"Level": 3
		},
		{
			"Tech": "TypeScript",
			"Level": 2
		},
		{
			"Tech": "Unity3D",
			"Level": 1
		}
	],
	"CoverLetterClosing": {
		"PT": "sincera e respeitosamente",
		"EN": "sincerely and respectfully"
	},
	"ProfessionalTitle": {
		"PT": "Experiência profissional",
		"EN": "Professional experience"
	},
	"Professional": [
		{
			"Enterprise": "Grupo Ser",
			"Start": "2007-02",
			"End": "2010-04",
			"EnterpriseDescription": {
				"PT": "Empresa de RH para avaliação de candidaturas a vagas. Possui um sistema online de questionários, tanto psicológicos, quanto criados por clientes - técnicos.",
				"EN": "HR enterprise to evaluate job candidates. Has an online questionnaires system, both psychological and technical - this one made by clients."
			},
			"Role": {
				"PT": "Programação",
				"EN": "Programming"
			},
			"Responsability": {
				"PT": "Manutenção e criação de novas funcionalidades para sistema de questionários.",
				"EN": "Maintenance and criation of new features to the questionnaires system."
			},
			"Details": [
				{
					"Text": {
						"PT": "-",
						"EN": "Starting to replace a colleague, after the second month I took soleny responsibility over the entire system: database, backend and frontend. During my years there, I had three people to teach and manage. The technologies I learn there were classic ASP, IIS, SQL, HTML, CSS and Javascript."
					}
				}
			],
			"Highlights": [
				{
					"Text": {
						"PT": "-",
						"EN": "I entered to took care of the entire system. I had too little experience and they trust me to be doing the job by myself from the second month"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "I had three other interns on my responsibility"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "When I left, I still worked with them as freelancer to teach the new developer and solve bugs."
					}
				}
			],
			"Projects": [
				{
					"Text": {
						"PT": "Desenvolvimento e manutenção do sistema web, backend e frontend",
						"EN": "Development and maintenance of web system, backend and frontend"
					},
					"Tools": "ASP, SQL Server, HTML, CSS, Javascript"
				}
			]
		},
		{
			"Enterprise": "Inspira Tecnologia",
			"Start": "2010-05",
			"End": "2016-11",
			"EnterpriseDescription": {
				"PT": "Empresa de tecnologia e inovação que trabalha com metodologias ágeis e possui cultura de aprendizado contínuo. Possui projetos de diversos contextos técnicos, tais como sistemas web, aplicações mobile, consultoria e análise de negócio.",
				"EN": "Technology and innovation enterprise which uses agile methodologies and has a continuous learning culture. Develop project in a variaty of technical contexts as web systems, mobile apps, consulting and business analysis."
			},
			"Role": {
				"PT": "Análise e Programação",
				"EN": "Analysis and Programming"
			},
			"Responsability": {
				"PT": "Desenvolvimento e manutenção de sistemas para clientes, de hotsites a sistemas web mais complexos",
				"EN": "Client system development and maintenance, from marketing site to more complex web systems"
			},
			"Details": [
				{
					"Text": {
						"PT": "-",
						"EN": "I worked in several projects at Inspira. During my time there, I evolved a lot and I grew as developer and as a person and I had the opportunity to taught other developers."
					}
				}
			],
			"Highlights": [
				{
					"Text": {
						"PT": "-",
						"EN": "I took responsibility of 4 project at same time, I had to balance the tasks of the project and priorities"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "I taught interns in programming languages and development pathways"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "I started a project in automatic testing with a technology I had learned in my personal project and this is nowadays still used to teach people in the company"
					}
				}
			],
			"Projects": [
				{
					"Text": {
						"PT": "Sistema de gerenciamento para esportes e fisioterapia",
						"EN": "Sport and physiotherapy management system"
					},
					"Tools": ".NET, C#, MVC, NHibernate, SQL"
				},
				{
					"Text": {
						"PT": "Sistema de organização de ONGs",
						"EN": "NGO organization system"
					},
					"Tools": ".NET, C#, WebForms, TSQL"
				},
				{
					"Text": {
						"PT": "Website de administradora de energia",
						"EN": "Energy manager website"
					},
					"Tools": ".NET, C#"
				},
				{
					"Text": {
						"PT": "Website de empresa de aviação",
						"EN": "Flight company website"
					},
					"Tools": ".NET, C#"
				},
				{
					"Text": {
						"PT": "Hotsite de operadora de telefonia móvel",
						"EN": "Mobile operator marketing site"
					},
					"Tools": ".NET, C#, TSQL"
				},
				{
					"Text": {
						"PT": "Sistema de cadastro de startup para colaboração",
						"EN": "Startup collaboration system"
					},
					"Tools": ".NET, C#, MVC, NHibernate, SQL"
				},
				{
					"Text": {
						"PT": "E-commerce de editora de livros e escola de pós-graduação e cursos ",
						"EN": "Book publishing and courses company e-commerce"
					},
					"Tools": ".NET, C#, NopCommerce, WebForms, EntityFramework"
				},
				{
					"Text": {
						"PT": "Sistema de gerenciamento de transações de cartão, parte Desktop e Web",
						"EN": "Card transactions system site and desktop app"
					},
					"Tools": ".NET, Windows Forms, C#, MVC, NHibernate, MySQL"
				},
				{
					"Text": {
						"PT": "Escrita e implementação de Testes Automatizados para sistema de gerenciamento de assinaturas eletrônicas ",
						"EN": "Writing and implementation of automated tests to an eletronic contract signing company"
					},
					"Tools": ".NET, C#, SpecFlow"
				}
			]
		},
		{
			"Enterprise": "Pagar.me Pagamentos",
			"Start": "2017-03",
			"End": "2019-08",
			"EnterpriseDescription": {
				"PT": "Backend de pagamentos de e-commerces",
				"EN": "E-commerce payments backend"
			},
			"Role": {
				"PT": "Desenvolvimento Sênior",
				"EN": "Senior Development"
			},
			"Responsability": {
				"PT": "Manutenção de mundo físico e de backend core",
				"EN": "Maintenance of physical transactions sdks and company core backend"
			},
			"Details": [
				{
					"Text": {
						"PT": "-",
						"EN": "I've worked in some projects while working in Pagar.me. The first of it was an .NET SDK for communicating with payment machines. After that, I was part of the team that was responsible for creating a new unified frontend library for the mother-company of Pagar.me, using React. Then I started the development of integration to use voucher cards in payment machines. I was part of a security improvement the company had to make, when I had to pair with a bunch of different teams to achieve the results. As last project I went to a team to start a new project, to attend smaller clients that needed payment machines to improve their business and modernize their way to sell their goods."
					}
				}
			],
			"Highlights": [
				{
					"Text": {
						"PT": "-",
						"EN": "I was part of the team that started the project to create a default UI for the entire company to develop its websites, in React"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "I took responsibility and fought for a project to implement something that was promised to a client years before - the client was even threatening to sue out company. After it was approved, I spent 15 days working with no rest to make it happen"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "I started with two colleagues a new project to develop an application to a new product of the company. They both were novice and I was the only one that knows the language at the company, I was the one that suggested it when the project started"
					}
				}
			],
			"Projects": [
				{
					"Text": {
						"PT": "SDKs Mpos",
						"EN": "Machines SDK"
					},
					"Tools": ".NET, Kotlin, Rust"
				},
				{
					"Text": {
						"PT": "Aplicativo de comunicação de maquininha com site de cliente",
						"EN": "App to communicate machine with client site"
					},
					"Tools": ".NET"
				},
				{
					"Text": {
						"PT": "Manutenções no sistema core",
						"EN": "Maintenance at the company core system"
					},
					"Tools": "Node"
				},
				{
					"Text": {
						"PT": "Aplicativo de pagamento e gerenciamento de transações com cartões físicos",
						"EN": "App of payment and transaction management with physical cards"
					},
					"Tools": "Kotlin"
				},
				{
					"Text": {
						"PT": "Início de uma nova dashboard com unificação da identidade visual da empresa",
						"EN": "Start of new dashboard with company visual identity unification"
					},
					"Tools": "React"
				}
			]
		},
		{
			"Enterprise": "ThoughtWorks Brasil",
			"Start": "2019-10",
			"End": "2022-12",
			"EnterpriseDescription": {
				"PT": "Consultoria em TI",
				"EN": "IT Consulting"
			},
			"Role": {
				"PT": "Consultoria e desenvolvimento",
				"EN": "Consulting and development"
			},
			"Responsability": {
				"PT": "Consultoria em projetos clientes",
				"EN": "Client projects consulting"
			},
			"Details": [
				{
					"Text": {
						"PT": "-",
						"EN": "The work here is about consultancy, development and maintenance of client and internal software. Thoughtworks follows best practices, continuous improvement, pairing, TDD and other agile practices."
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "The first project was an internal one, to make easier to understand the health of the kanban boards using a fictional character state to show how the project was. This is helped me improving my Node knowledge. Some months after, I went to a client project, that manages rental and sell of houses and flats. There I had experience with microservices with Java and BFF methodology (backend-for-frontend). Then I went to my first international project, implementing Observability using Grafana and Docker."
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "The fourth project is attending internal clients, using Google AppScript, Docker, Postgres, TypeScript and TDD. In this team, I'm the security champion."
					}
				}
			],
			"Highlights": [
				{
					"Text": {
						"PT": "-",
						"EN": "I'm recognized as someone that knows git deeply, and people come to me when they have a problem to solve in this matter"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "When the team needed a security champion, people suggested that it was me, giving my attention to details and risks that not everyone is aware to, and this is currently one of my responsibilities"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "People praise me for being always alert to people welfare, trying to bring an environment where everyone feels safe"
					}
				}
			],
			"Projects": [
				{
					"Text": {
						"PT": "Projeto de representação gráfica de métricas ágeis",
						"EN": "Agile metrics graphical representation project"
					},
					"Tools": "Java"
				},
				{
					"Text": {
						"PT": "Site para imobiliária",
						"EN": "Real state agency website"
					},
					"Tools": "Java, Node, Angular"
				},
				{
					"Text": {
						"PT": "Projeto de observação de métricas de funcionamento de infra",
						"EN": "Infrastructure metrics for observability"
					},
					"Tools": "C#, Docker, Grafana"
				},
				{
					"Text": {
						"PT": "Automatização de planilhas financeiras usando addon",
						"EN": "Finantial spreadsheet automation using addon"
					},
					"Tools": "Typescript, Node, Google App Script, Postgres"
				},
				{
					"Text": {
						"PT": "Sistema web para mentoria interna na empresa",
						"EN": "Web system for enterprise internal mentoring"
					},
					"Tools": "Typescript, Node, Postgres"
				}
			]
		},
	],
	"IndependentTitle": {
		"PT": "Projetos Independentes",
		"EN": "Independent projects"
	},
	"Independent": [
		{
			"Enterprise": "Don’t fly Money",
			"Start": "2010",
			"End": null,
			"EnterpriseDescription": {
				"PT": "É um sistema de gerenciamento financeiro que visa uma forma simples de gerenciar os ganhos e gastos de uma pessoa.",
				"EN": "It is a financial management system built to be a simple way to manage a person cash inflows and outflows"
			},
			"Role": {
				"PT": "Projeto independente",
				"EN": "Independent project"
			},
			"Details": [
				{
					"Text": {
						"PT": "-",
						"EN": "Maintainer of the personal financial management system, built with C# .NET Core, Kotlin, Node and Rust. For tests, using BDD, TDD, puppeteer, specflow and roboeletric. Docker for running locally and in the server, RDS DB and EC2 Linux for production. Uses SES, Lambda and S3 for e-mails. One goal is to improve the CI: nowadays it already runs all the tests, the objective is to make it deploy too, becoming a CD too."
					}
				}
			],
			"Highlights": [
				{
					"Text": {
						"PT": "-",
						"EN": "This is a project I created and I still maintain since 2010"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "It has a good range of different technologies and I keep the libraries always up to date"
					}
				},
				{
					"Text": {
						"PT": "-",
						"EN": "I already had to change the server from windows to linux, giving the difference between my currency and US dollar it was becoming too expensive to keep it, so I had to plan and execute with caution the migration from .NET Framework to .NET Core and from Windows to Linux after that"
					}
				}
			],
			"Urls": [
				{
					"Url": "http://dontflymoney.com"
				},
				{
					"Url": "https://github.com/darakeon/dfm/"
				}
			],
			"Projects": [
				{
					"Text": {
						"PT": "Biblioteca principal com a lógica de negócio, com testes automatizados",
						"EN": "Core library with business logic with automated tests"
					},
					"Tools": ".NET, C#, NHibernate, BDD, Specflow"
				},
				{
					"Text": {
						"PT": "Site com testes automatizados de browser",
						"EN": "Website with browser automated tests"
					},
					"Tools": ".NET, C#, MVC, HTML, CSS, javascript, jQuery, Bootstrap, Puppeteer"
				},
				{
					"Text": {
						"PT": "API",
						"EN": "API"
					},
					"Tools": ".NET, C#, MVC"
				},
				{
					"Text": {
						"PT": "Aplicativo Android com testes automatizados",
						"EN": "Android app with automated tests"
					},
					"Tools": "Kotlin, retrofit, junit, robolectric"
				},
				{
					"Text": {
						"PT": "Banco de dados",
						"EN": "Database"
					},
					"Tools": "MySQL, AWS RDS"
				},
				{
					"Text": {
						"PT": "Servidor web",
						"EN": "Webserver"
					},
					"Tools": "AWS EC2 / Route53, Docker"
				},
				{
					"Text": {
						"PT": "Integração com testes automatizados rodando a cada push",
						"EN": "Integration with automated tests running at push"
					},
					"Tools": "Circle CI, Docker"
				},
				{
					"Text": {
						"PT": "Envio de e-mails para notificações a quem usa o sistema",
						"EN": "E-mail to send notifications to the people who uses the system"
					},
					"Tools": "AWS SES / Lambda / S3"
				}
			]
		}
	],
	"AcademicTitle": {
		"PT": "Formação acadêmica",
		"EN": "Academic"
	},
	"Academic": [
		{
			"Instituition": "FATEC (Faculdade de Tecnologia de São Paulo)",
			"Description": {
				"PT": "Análise e Programação em diversas linguagens: Pascal, C, Cobol, TSQL. Sistema Operacional Linux e fundamentos do funcionamento de Sistemas Operacionais. Documentação de sistemas.",
				"EN": "Analysis and Programming in a number of languages: Pascal, C, Cobol, TSQL. OS Linux and fundamentals of OSs working. System documenting."
			},
			"Start": "2007",
			"End": "2010",
			"Course": {
				"PT": "Tecnologia em Processamento de Dados",
				"EN": "Barchelor Degree in Data Processing Technology (IT)"
			}
		},
		{
			"Instituition": "SENAC (Serviço Nacional de Aprendizagem Comercial)",
			"Description": {
				"PT": "Pós-graduação focada em Jogos usando Unity 3D. Aprendido desde o projeto do jogo e design, música, modelagem e programação.",
				"EN": "Post graduation focused in Games using Unity 3D. Learned from game project and design, music, modeling and programming."
			},
			"Start": "2013",
			"End": "2014",
			"Course": {
				"PT": "Pós Graduação em Games: Produção e Programação",
				"EN": "Post-graduation - Games: Production and Programming"
			}
		}
	],
	"Additional": [
		{
			"Title": {
				"PT": "Cursos",
				"EN": "Courses"
			},
			"Items": [
				{
					"Description": {
						"PT": "Inglês leitura avançado, conversação intermediário - Wizard",
						"EN": "English advanced reading, intermediary conversation - Wizard"
					}
				},
				{
					"Description": {
						"PT": ".NET Foundation - Brás Figueiredo",
						"EN": ".NET Foundation - Brás Figueiredo"
					}
				}
			]
		},
		{
			"Title": {
				"PT": "Eventos comparecidos",
				"EN": "Attended events"
			},
			"Items": [
				{
					"Description": "Agile Vale 2011"
				},
				{
					"Description": "Agile Vale 2013"
				},
				{
					"Description": "CryptoRave 2014"
				},
				{
					"Description": "CryptoRave 2015"
				},
				{
					"Description": "CryptoRave 2018"
				},
				{
					"Description": ".NET Community Summit 2018 (iMasters)"
				},
				{
					"Description": "Android Community Summit 2018 (iMasters)"
				},
				{
					"Description": "CryptoRave 2019"
				}
			]
		},
		{
			"Title": {
				"PT": "Talks - canal Pagar.me",
				"EN": "Talks - Pagar.me channel - in portuguese"
			},
			"Items": [
				{
					"Description": {
						"PT": "Números binários",
						"EN": "Binary numbers"
					},
					"Url": "https://www.youtube.com/watch?v=SNnO1ki2t78"
				},
				{
					"Description": {
						"PT": "Pessoas Trans",
						"EN": "Transgender people"
					},
					"Url": "https://www.youtube.com/watch?v=XAwhx1AZQIU&t"
				},
				{
					"Description": {
						"PT": "De Java a Kotlin",
						"EN": "From Java to Kotlin"
					},
					"Url": "https://www.youtube.com/watch?v=xcCLjD3kJRQ"
				},
				{
					"Description": {
						"PT": "Regex",
						"EN": "Regex"
					},
					"Url": "https://www.youtube.com/watch?v=TPO3GGHME_s"
				},
				{
					"Description": {
						"PT": "Como tirar gênero de textos (de forma natural)",
						"EN": "How to remove gender from text (in portuguese it is harder than english)"
					},
					"Url": "https://www.youtube.com/watch?v=BMQRGt2T-sw"
				}
			]
		}
	]
}